// Licensed under the Apache License, Version 2.0 <LICENSE-APACHE or
// http://www.apache.org/licenses/LICENSE-2.0> or the MIT license
// <LICENSE-MIT or http://opensource.org/licenses/MIT>, at your
// option. This file may not be copied, modified, or distributed
// except according to those terms.

// Generated by bindgen. Do not edit.
// Regenerate and verify with CI workflow.

/* automatically generated by rust-bindgen 0.72.1 */

pub type __u16 = ::std::os::raw::c_ushort;
pub type __u32 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct nlmsghdr {
    pub nlmsg_len: __u32,
    pub nlmsg_type: __u16,
    pub nlmsg_flags: __u16,
    pub nlmsg_seq: __u32,
    pub nlmsg_pid: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nlmsghdr"][::std::mem::size_of::<nlmsghdr>() - 16usize];
    ["Alignment of nlmsghdr"][::std::mem::align_of::<nlmsghdr>() - 4usize];
    ["Offset of field: nlmsghdr::nlmsg_len"][::std::mem::offset_of!(nlmsghdr, nlmsg_len) - 0usize];
    ["Offset of field: nlmsghdr::nlmsg_type"]
        [::std::mem::offset_of!(nlmsghdr, nlmsg_type) - 4usize];
    ["Offset of field: nlmsghdr::nlmsg_flags"]
        [::std::mem::offset_of!(nlmsghdr, nlmsg_flags) - 6usize];
    ["Offset of field: nlmsghdr::nlmsg_seq"][::std::mem::offset_of!(nlmsghdr, nlmsg_seq) - 8usize];
    ["Offset of field: nlmsghdr::nlmsg_pid"][::std::mem::offset_of!(nlmsghdr, nlmsg_pid) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rtattr {
    pub rta_len: ::std::os::raw::c_ushort,
    pub rta_type: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rtattr"][::std::mem::size_of::<rtattr>() - 4usize];
    ["Alignment of rtattr"][::std::mem::align_of::<rtattr>() - 2usize];
    ["Offset of field: rtattr::rta_len"][::std::mem::offset_of!(rtattr, rta_len) - 0usize];
    ["Offset of field: rtattr::rta_type"][::std::mem::offset_of!(rtattr, rta_type) - 2usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rtmsg {
    pub rtm_family: ::std::os::raw::c_uchar,
    pub rtm_dst_len: ::std::os::raw::c_uchar,
    pub rtm_src_len: ::std::os::raw::c_uchar,
    pub rtm_tos: ::std::os::raw::c_uchar,
    pub rtm_table: ::std::os::raw::c_uchar,
    pub rtm_protocol: ::std::os::raw::c_uchar,
    pub rtm_scope: ::std::os::raw::c_uchar,
    pub rtm_type: ::std::os::raw::c_uchar,
    pub rtm_flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rtmsg"][::std::mem::size_of::<rtmsg>() - 12usize];
    ["Alignment of rtmsg"][::std::mem::align_of::<rtmsg>() - 4usize];
    ["Offset of field: rtmsg::rtm_family"][::std::mem::offset_of!(rtmsg, rtm_family) - 0usize];
    ["Offset of field: rtmsg::rtm_dst_len"][::std::mem::offset_of!(rtmsg, rtm_dst_len) - 1usize];
    ["Offset of field: rtmsg::rtm_src_len"][::std::mem::offset_of!(rtmsg, rtm_src_len) - 2usize];
    ["Offset of field: rtmsg::rtm_tos"][::std::mem::offset_of!(rtmsg, rtm_tos) - 3usize];
    ["Offset of field: rtmsg::rtm_table"][::std::mem::offset_of!(rtmsg, rtm_table) - 4usize];
    ["Offset of field: rtmsg::rtm_protocol"][::std::mem::offset_of!(rtmsg, rtm_protocol) - 5usize];
    ["Offset of field: rtmsg::rtm_scope"][::std::mem::offset_of!(rtmsg, rtm_scope) - 6usize];
    ["Offset of field: rtmsg::rtm_type"][::std::mem::offset_of!(rtmsg, rtm_type) - 7usize];
    ["Offset of field: rtmsg::rtm_flags"][::std::mem::offset_of!(rtmsg, rtm_flags) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ifinfomsg {
    pub ifi_family: ::std::os::raw::c_uchar,
    pub __ifi_pad: ::std::os::raw::c_uchar,
    pub ifi_type: ::std::os::raw::c_ushort,
    pub ifi_index: ::std::os::raw::c_int,
    pub ifi_flags: ::std::os::raw::c_uint,
    pub ifi_change: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ifinfomsg"][::std::mem::size_of::<ifinfomsg>() - 16usize];
    ["Alignment of ifinfomsg"][::std::mem::align_of::<ifinfomsg>() - 4usize];
    ["Offset of field: ifinfomsg::ifi_family"]
        [::std::mem::offset_of!(ifinfomsg, ifi_family) - 0usize];
    ["Offset of field: ifinfomsg::__ifi_pad"]
        [::std::mem::offset_of!(ifinfomsg, __ifi_pad) - 1usize];
    ["Offset of field: ifinfomsg::ifi_type"][::std::mem::offset_of!(ifinfomsg, ifi_type) - 2usize];
    ["Offset of field: ifinfomsg::ifi_index"]
        [::std::mem::offset_of!(ifinfomsg, ifi_index) - 4usize];
    ["Offset of field: ifinfomsg::ifi_flags"]
        [::std::mem::offset_of!(ifinfomsg, ifi_flags) - 8usize];
    ["Offset of field: ifinfomsg::ifi_change"]
        [::std::mem::offset_of!(ifinfomsg, ifi_change) - 12usize];
};
