/* automatically generated by rust-bindgen 0.72.1 */

pub const RTM_VERSION: u32 = 4;
pub const RTM_GET: u32 = 4;
pub const RTA_DST: u32 = 1;
pub const RTA_IFP: u32 = 16;
pub const RTAX_MAX: u32 = 9;
pub type __int32_t = ::std::os::raw::c_int;
pub type __int64_t = ::std::os::raw::c_long;
pub type __pid_t = __int32_t;
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type time_t = __int64_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct if_data {
    pub ifi_type: u_char,
    pub ifi_addrlen: u_char,
    pub ifi_hdrlen: u_char,
    pub __bindgen_padding_0: u8,
    pub ifi_link_state: ::std::os::raw::c_int,
    pub ifi_mtu: u64,
    pub ifi_metric: u64,
    pub ifi_baudrate: u64,
    pub ifi_ipackets: u64,
    pub ifi_ierrors: u64,
    pub ifi_opackets: u64,
    pub ifi_oerrors: u64,
    pub ifi_collisions: u64,
    pub ifi_ibytes: u64,
    pub ifi_obytes: u64,
    pub ifi_imcasts: u64,
    pub ifi_omcasts: u64,
    pub ifi_iqdrops: u64,
    pub ifi_noproto: u64,
    pub ifi_lastchange: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of if_data"][::std::mem::size_of::<if_data>() - 136usize];
    ["Alignment of if_data"][::std::mem::align_of::<if_data>() - 8usize];
    ["Offset of field: if_data::ifi_type"][::std::mem::offset_of!(if_data, ifi_type) - 0usize];
    ["Offset of field: if_data::ifi_addrlen"]
        [::std::mem::offset_of!(if_data, ifi_addrlen) - 1usize];
    ["Offset of field: if_data::ifi_hdrlen"][::std::mem::offset_of!(if_data, ifi_hdrlen) - 2usize];
    ["Offset of field: if_data::ifi_link_state"]
        [::std::mem::offset_of!(if_data, ifi_link_state) - 4usize];
    ["Offset of field: if_data::ifi_mtu"][::std::mem::offset_of!(if_data, ifi_mtu) - 8usize];
    ["Offset of field: if_data::ifi_metric"][::std::mem::offset_of!(if_data, ifi_metric) - 16usize];
    ["Offset of field: if_data::ifi_baudrate"]
        [::std::mem::offset_of!(if_data, ifi_baudrate) - 24usize];
    ["Offset of field: if_data::ifi_ipackets"]
        [::std::mem::offset_of!(if_data, ifi_ipackets) - 32usize];
    ["Offset of field: if_data::ifi_ierrors"]
        [::std::mem::offset_of!(if_data, ifi_ierrors) - 40usize];
    ["Offset of field: if_data::ifi_opackets"]
        [::std::mem::offset_of!(if_data, ifi_opackets) - 48usize];
    ["Offset of field: if_data::ifi_oerrors"]
        [::std::mem::offset_of!(if_data, ifi_oerrors) - 56usize];
    ["Offset of field: if_data::ifi_collisions"]
        [::std::mem::offset_of!(if_data, ifi_collisions) - 64usize];
    ["Offset of field: if_data::ifi_ibytes"][::std::mem::offset_of!(if_data, ifi_ibytes) - 72usize];
    ["Offset of field: if_data::ifi_obytes"][::std::mem::offset_of!(if_data, ifi_obytes) - 80usize];
    ["Offset of field: if_data::ifi_imcasts"]
        [::std::mem::offset_of!(if_data, ifi_imcasts) - 88usize];
    ["Offset of field: if_data::ifi_omcasts"]
        [::std::mem::offset_of!(if_data, ifi_omcasts) - 96usize];
    ["Offset of field: if_data::ifi_iqdrops"]
        [::std::mem::offset_of!(if_data, ifi_iqdrops) - 104usize];
    ["Offset of field: if_data::ifi_noproto"]
        [::std::mem::offset_of!(if_data, ifi_noproto) - 112usize];
    ["Offset of field: if_data::ifi_lastchange"]
        [::std::mem::offset_of!(if_data, ifi_lastchange) - 120usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rt_metrics {
    pub rmx_locks: u64,
    pub rmx_mtu: u64,
    pub rmx_hopcount: u64,
    pub rmx_recvpipe: u64,
    pub rmx_sendpipe: u64,
    pub rmx_ssthresh: u64,
    pub rmx_rtt: u64,
    pub rmx_rttvar: u64,
    pub rmx_expire: time_t,
    pub rmx_pksent: time_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rt_metrics"][::std::mem::size_of::<rt_metrics>() - 80usize];
    ["Alignment of rt_metrics"][::std::mem::align_of::<rt_metrics>() - 8usize];
    ["Offset of field: rt_metrics::rmx_locks"]
        [::std::mem::offset_of!(rt_metrics, rmx_locks) - 0usize];
    ["Offset of field: rt_metrics::rmx_mtu"][::std::mem::offset_of!(rt_metrics, rmx_mtu) - 8usize];
    ["Offset of field: rt_metrics::rmx_hopcount"]
        [::std::mem::offset_of!(rt_metrics, rmx_hopcount) - 16usize];
    ["Offset of field: rt_metrics::rmx_recvpipe"]
        [::std::mem::offset_of!(rt_metrics, rmx_recvpipe) - 24usize];
    ["Offset of field: rt_metrics::rmx_sendpipe"]
        [::std::mem::offset_of!(rt_metrics, rmx_sendpipe) - 32usize];
    ["Offset of field: rt_metrics::rmx_ssthresh"]
        [::std::mem::offset_of!(rt_metrics, rmx_ssthresh) - 40usize];
    ["Offset of field: rt_metrics::rmx_rtt"][::std::mem::offset_of!(rt_metrics, rmx_rtt) - 48usize];
    ["Offset of field: rt_metrics::rmx_rttvar"]
        [::std::mem::offset_of!(rt_metrics, rmx_rttvar) - 56usize];
    ["Offset of field: rt_metrics::rmx_expire"]
        [::std::mem::offset_of!(rt_metrics, rmx_expire) - 64usize];
    ["Offset of field: rt_metrics::rmx_pksent"]
        [::std::mem::offset_of!(rt_metrics, rmx_pksent) - 72usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rt_msghdr {
    pub rtm_msglen: u_short,
    pub rtm_version: u_char,
    pub rtm_type: u_char,
    pub rtm_index: u_short,
    pub __bindgen_padding_0: [u8; 2usize],
    pub rtm_flags: ::std::os::raw::c_int,
    pub rtm_addrs: ::std::os::raw::c_int,
    pub rtm_pid: __pid_t,
    pub rtm_seq: ::std::os::raw::c_int,
    pub rtm_errno: ::std::os::raw::c_int,
    pub rtm_use: ::std::os::raw::c_int,
    pub rtm_inits: ::std::os::raw::c_int,
    pub __bindgen_padding_1: [u8; 4usize],
    pub rtm_rmx: rt_metrics,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rt_msghdr"][::std::mem::size_of::<rt_msghdr>() - 120usize];
    ["Alignment of rt_msghdr"][::std::mem::align_of::<rt_msghdr>() - 8usize];
    ["Offset of field: rt_msghdr::rtm_msglen"]
        [::std::mem::offset_of!(rt_msghdr, rtm_msglen) - 0usize];
    ["Offset of field: rt_msghdr::rtm_version"]
        [::std::mem::offset_of!(rt_msghdr, rtm_version) - 2usize];
    ["Offset of field: rt_msghdr::rtm_type"][::std::mem::offset_of!(rt_msghdr, rtm_type) - 3usize];
    ["Offset of field: rt_msghdr::rtm_index"]
        [::std::mem::offset_of!(rt_msghdr, rtm_index) - 4usize];
    ["Offset of field: rt_msghdr::rtm_flags"]
        [::std::mem::offset_of!(rt_msghdr, rtm_flags) - 8usize];
    ["Offset of field: rt_msghdr::rtm_addrs"]
        [::std::mem::offset_of!(rt_msghdr, rtm_addrs) - 12usize];
    ["Offset of field: rt_msghdr::rtm_pid"][::std::mem::offset_of!(rt_msghdr, rtm_pid) - 16usize];
    ["Offset of field: rt_msghdr::rtm_seq"][::std::mem::offset_of!(rt_msghdr, rtm_seq) - 20usize];
    ["Offset of field: rt_msghdr::rtm_errno"]
        [::std::mem::offset_of!(rt_msghdr, rtm_errno) - 24usize];
    ["Offset of field: rt_msghdr::rtm_use"][::std::mem::offset_of!(rt_msghdr, rtm_use) - 28usize];
    ["Offset of field: rt_msghdr::rtm_inits"]
        [::std::mem::offset_of!(rt_msghdr, rtm_inits) - 32usize];
    ["Offset of field: rt_msghdr::rtm_rmx"][::std::mem::offset_of!(rt_msghdr, rtm_rmx) - 40usize];
};
